# -*- coding: utf-8 -*-
"""----------------------------------------------------------------------------
    カメラの位置姿勢推定処理部
    Created on Mon Aug  8 19:41:34 2016
    @author: Hisa
----------------------------------------------------------------------------"""


""" Import """
import BirdCamera as Bcamera
import BirdCamera_others as Bo
import numpy as np
import cv2


"""============================================================================
    localize func 
============================================================================"""
def localize(_H, _K):
    """
    カメラの位置姿勢推定関数
    """
    
    """ 空撮画像からモバイルカメラ画像へのホモグラフィ行列iHを算出 """
    iH = np.linalg.inv(_H)

    """-----------------------------
      P = K[R t] = K[r1 r2 r3 t]
      [r1 r2 t] = DOT(K.inv(), iH)
      r3 = CROSS(r1, r2)
      [R t] = [r1 r2 r3 t]
    -----------------------------"""
    
    """ r1, r2, t の算出 """
    X  = np.linalg.inv(_K).dot(iH)
    r1 = X[:,0]
    r2 = X[:,1]
    t  = X[:,2]
    
    """ norm の算出"""
    norm1 = np.linalg.norm(r1)
    norm2 = np.linalg.norm(r2)
    
    """ r3, t の算出 """
    r1 /= norm1
    r2 /= norm2 
    r3 = np.cross(r1,r2)
    t /= (norm1+norm2)/2.0
    
    """ 回転行列Rの算出 """
    R = np.c_[r1, np.c_[r2, r3]]
    
    #""" 剛体変換行列[Rt]生成 """
    #Rt = np.c_[R,t]
    
    """ Location の算出 """
    return Bo.LocRotData(R, t)


"""============================================================================
============================================================================"""
if __name__ == "__main__":
    """" main()関数呼び出し """
    Bcamera.main()
    
    
    